app/controllers/charts_controller.rb

  def index
    @charts = Chart.all
---
SELECT "charts".* FROM "charts"

  def create
    @chart = Chart.new(chart_params)
    @chart.user = @current_user

    if @chart.save
---
INSERT INTO "charts" ("name", "description", "image_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    if @chart.update(chart_params)
---
UPDATE "charts" SET "description" = $1, "updated_at" = $2 WHERE "charts"."id" = $3  [["description", "Shay to test with chart"], ["updated_at", "2020-08-18 18:05:57.693761"], ["id", 3]]

  def add_object
    @chart = Chart.find(params[:id])
    @memory_object = MemoryObject.where(params[:chart_id])
---
SELECT "charts".* FROM "charts" WHERE "charts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "memory_objects".* FROM "memory_objects" WHERE "memory_objects"."chart_id" = $1  [["chart_id", 3]]

  def destroy
    @chart.destroy
---
DELETE FROM "charts" WHERE "charts"."id" = $1  [["id", 3]]

    def set_chart
      @chart = Chart.find(params[:id])
---
SELECT "charts".* FROM "charts" WHERE "charts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]