app/controllers/memory_objects_controller.rb

  def index
    @memory_objects = MemoryObject.all
---
SELECT "memory_objects".* FROM "memory_objects"

  def create
    @memory_object = MemoryObject.new(memory_object_params)
    @memory_object.user = @current_user

    if @memory_object.save
---
INSERT INTO "memory_objects" ("number", "initials", "name", "description", "image_url", "user_id", "chart_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    if @memory_object.update(memory_object_params)
---
UPDATE "memory_objects" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "memory_objects"."id" = $4  [["name", "oppie ottle"], ["description", "fjskaldjsfas"], ["updated_at", "2020-08-18 19:38:55.725654"], ["id", 1]]

  def destroy
    @memory_object.destroy
---
DELETE FROM "memory_objects" WHERE "memory_objects"."id" = $1  [["id", 3]]

    def set_memory_object
      @memory_object = MemoryObject.find(params[:id])
---
SELECT "memory_objects".* FROM "memory_objects" WHERE "memory_objects"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]